app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "title", "updated_at", "created_at") VALUES('some content', 'some title', '2012-10-16 18:25:49', '2012-10-16 18:25:49')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 980190962)
---
  def update
    @post = Post.find(params[:id])